Locked-Inc/STAR/star-rx72n-firmware/src/main.c
  /* Register i2c1_baro - BMP280 barometric sensor (RIIC1, addr 0x76, SDA=P2.0, SCL=P2.1) */
  err = rx_bus_config_init_i2c(&s_i2c1_baro_config,
                               "i2c1_baro",             /* name: matches rx_bmp280.c s_bus_name */
                               k_riic_channel_1,        /* channel: RIIC1 (same as i2c1_imu) */
                               k_i2c_addr_bmp280,       /* device_addr: BMP280 (SDO=LOW) */
                               k_rx_p2_0,               /* sda_pin: P2.0 = SDA1 */
                               k_rx_p2_1,               /* scl_pin: P2.1 = SCL1 */
                               k_i2c_frequency_400khz); /* frequency_hz: 400 kHz fast mode */
  RX_ASSERT(err == k_rx_ok, "i2c1_baro (BMP280) config init must succeed");
  err = rx_bus_manager_add_bus(&g_bus_manager, &s_i2c1_baro_config);
  RX_ASSERT(err == k_rx_ok, "i2c1_baro (BMP280) registration must succeed");
  err = rx_bus_i2c_init(&g_bus_manager, "i2c1_baro");
  RX_ASSERT(err == k_rx_ok, "i2c1_baro (BMP280) I2C init must succeed");

  /* =========================================================================
   * BENCH PROBE: GY-521 / MPU-6050 WHO_AM_I at 0x68 on RIIC1
   * Purpose: confirm a fresh GY-521 wired to SDA1/SCL1 ACKs and returns 0x68
   *          (or 0x70 on MPU-6500 clones) from register 0x75.
   * No RX_ASSERT here -- if the module is absent, log and keep booting.
   * ========================================================================= */
  err = rx_bus_config_init_i2c(&s_i2c1_mpu_config,
                               "i2c1_mpu",              /* bench-test bus name */
                               k_riic_channel_1,        /* channel: RIIC1 */
                               k_i2c_addr_mpu6050,      /* device_addr: 0x68 */
                               k_rx_p2_0,               /* sda_pin: P2.0 = SDA1 */
                               k_rx_p2_1,               /* scl_pin: P2.1 = SCL1 */
                               k_i2c_frequency_400khz); /* frequency_hz: 400 kHz */
  if (err == k_rx_ok) {
    err = rx_bus_manager_add_bus(&g_bus_manager, &s_i2c1_mpu_config);
  }
  if (err == k_rx_ok) {
    err = rx_bus_i2c_init(&g_bus_manager, "i2c1_mpu");
  }
  uint8_t  who_am_i   = 0x00U;
  int32_t  probe_err  = err; /* preserve setup err if any */
  if (err == k_rx_ok) {
    const uint8_t who_am_i_reg = 0x75U; /* MPU-6050 WHO_AM_I register */
    err = rx_bus_i2c_write_read(&g_bus_manager, "i2c1_mpu", &who_am_i_reg, 1U,
                                &who_am_i, 1U);
    probe_err = err;
    if (err == k_rx_ok) {
      rx_log_info_val("MPU6050", "WHO_AM_I=0x", who_am_i);
    } else {
      rx_log_error_val("MPU6050", "WHO_AM_I read failed err=", (uint32_t)err);
    }
  } else {
    rx_log_error_val("MPU6050", "bus setup failed err=", (uint32_t)err);
  }

  /* Persist the result to data flash @ 0x00100000 so it's readable via
   * rfp-cli -rv 0x00100000 16 without needing the UART bridge. */
  internal_bench_dflash_write(who_am_i, probe_err);
}

/**
 * @brief Initialize shared data module and hardware watchdog timer
 *
 * @details
 * Sets up inter-task communication (ThreadX mutexes and event flags via shared_data_init)
 * and initializes the Independent Watchdog Timer with state-dependent timeouts.
 *
 * @pre internal_register_system_buses() completed (buses available for tasks)
 * @pre ThreadX kernel initialized (mutex/event-flag creation available)
 *
 * @post Shared data mutexes and event flags created and ready for task use
 * @post IWDT hardware configured with s_iwdt_config parameters
 *
 * @note Executes in single-threaded context (scheduler not started). No synchronization needed.
 *
 * @see shared_data_init() Inter-task communication setup
 * @see rx_iwdt_init() Hardware watchdog initialization
 *
 * @since Version 1.0.0
 */
static void internal_init_shared_data_and_watchdog(void)
{
  /* Initialize shared data module (mutexes, event flags) */
  rx_err_t err = shared_data_init();
  RX_ASSERT(err == k_rx_ok, "shared_data_init must succeed");

  /* Initialize IWDT (hardware watchdog + task monitoring) */
  err = rx_iwdt_init(&s_iwdt_config);
  RX_ASSERT(err == k_rx_ok, "rx_iwdt_init must succeed");
}

/**
 * @brief Register all eight tasks for IWDT heartbeat monitoring and set initial state
 *
 * @details
 * Registers each application task with the IWDT module so that missed heartbeats
 * are detected. Timeouts are set to 3x the nominal task period to allow two
 * missed heartbeats before a timeout is declared.
 *
 * Task timeout mapping:
 * - Telemetry (50ms period) -> 150ms timeout
 * - LED Status (50ms period) -> 150ms timeout
 * - Temp Sensor (1000ms period) -> 3000ms timeout
 * - Obstacle Detect (20ms period) -> 60ms timeout
 * - Motor Control (10ms period) -> 30ms timeout
 * - Communication (10ms period) -> 30ms timeout
 * - Watchdog Monitor (10ms period) -> 30ms timeout
 *
 * After all tasks are registered the system state is set to k_system_state_init
 * so the IWDT uses the 5-second init-phase timeout.
 *
 * @pre internal_init_shared_data_and_watchdog() completed (IWDT initialized)
 * @pre No tasks registered yet (first call after rx_iwdt_init)
 *
 * @post All eight tasks registered with per-task heartbeat timeouts
 * @post IWDT system state set to k_system_state_init (5s timeout)
 *
 * @note Executes in single-threaded context (scheduler not started). No synchronization needed.
 *
 * @see rx_iwdt_register_task() Registers a single task for monitoring
 * @see rx_iwdt_set_state() Sets system state for state-dependent timeouts
 *
 * @since Version 1.0.0
 */
static void internal_register_iwdt_tasks(void)
{
  rx_err_t err = rx_iwdt_register_task("Telemetry", k_iwdt_task_timeout_telemetry_ms);
  RX_ASSERT(err == k_rx_ok, "Telemetry IWDT registration must succeed");

  err = rx_iwdt_register_task("LEDStatus", k_iwdt_task_timeout_ledstatus_ms);
  RX_ASSERT(err == k_rx_ok, "LEDStatus IWDT registration must succeed");

  err = rx_iwdt_register_task("TempSensor", k_iwdt_task_timeout_tempsensor_ms);
  RX_ASSERT(err == k_rx_ok, "TempSensor IWDT registration must succeed");

  err = rx_iwdt_register_task("ObstDetect", k_iwdt_task_timeout_obstdetect_ms);
  RX_ASSERT(err == k_rx_ok, "ObstDetect IWDT registration must succeed");

