Locked-Inc/STAR/star-rx72n-firmware/src/main.c
  err = rx_iwdt_register_task("MotorCtrl", k_iwdt_task_timeout_motorctrl_ms);
  RX_ASSERT(err == k_rx_ok, "MotorCtrl IWDT registration must succeed");

  err = rx_iwdt_register_task("CommTask", k_iwdt_task_timeout_commtask_ms);
  RX_ASSERT(err == k_rx_ok, "CommTask IWDT registration must succeed");

  err = rx_iwdt_register_task("WatchdogMon", k_iwdt_task_timeout_watchdog_ms);
  RX_ASSERT(err == k_rx_ok, "WatchdogMon IWDT registration must succeed");

  err = rx_iwdt_register_task("ImuTask", k_iwdt_task_timeout_imu_ms);
  RX_ASSERT(err == k_rx_ok, "ImuTask IWDT registration must succeed");

  /* Set initial IWDT state (init phase - 5s timeout) */
  err = rx_iwdt_set_state(k_system_state_init);
  RX_ASSERT(err == k_rx_ok, "IWDT set init state must succeed");
}

/**
 * @brief Create all eight application tasks and transition to running state
 *
 * @details
 * Creates all eight ThreadX tasks in dependency-aware order (lowest priority
 * first, except Watchdog Monitor which follows Communication for logical
 * grouping). Tasks do not begin executing until tx_application_define()
 * returns and the scheduler starts. After all tasks are created, the IWDT
 * system state transitions to k_system_state_running.
 *
 * Task creation order:
 * 1. Telemetry (priority 18, lowest)
 * 2. LED Status (priority 17)
 * 3. Temperature Sensor (priority 15)
 * 4. IMU (priority 13, BNO055 + BMP280)
 * 5. Obstacle Detection (priority 12)
 * 6. Motor Control (priority 8)
 * 7. Communication (priority 5)
 * 8. Watchdog Monitor (priority 6)
 *
 * @pre internal_register_iwdt_tasks() completed (all tasks registered for monitoring)
 * @pre Static task stacks allocated in each task module
 *
 * @post All eight ThreadX threads created in READY state
 * @post IWDT system state set to k_system_state_running (2s timeout)
 *
 * @note Executes in single-threaded context (scheduler not started). No synchronization needed.
 * @note Tasks do not begin executing until tx_application_define() returns.
 *
 * @see telemetry_task_create() through watchdog_monitor_task_create()
 * @see rx_iwdt_set_state() Transitions to running state after task creation
 *
 * @since Version 1.0.0
 */
static void internal_create_system_tasks(void)
{
  /* Telemetry Task - Priority 18 (lowest) */
  rx_err_t err = telemetry_task_create();
  RX_ASSERT(err == k_rx_ok, "telemetry_task_create must succeed");

  /* LED Status Task - Priority 17 (visual feedback) */
  err = led_status_task_create();
  RX_ASSERT(err == k_rx_ok, "led_status_task_create must succeed");

  /* Temperature Sensor Task - Priority 15 */
  err = temp_sensor_task_create();
  RX_ASSERT(err == k_rx_ok, "temp_sensor_task_create must succeed");

  /* IMU Task - Priority 13 (BNO055 + BMP280 at 20 Hz) */
  err = imu_task_create();
  RX_ASSERT(err == k_rx_ok, "imu_task_create must succeed");

  /* Obstacle Detection Task - Priority 12 */
  err = obstacle_detect_task_create();
  RX_ASSERT(err == k_rx_ok, "obstacle_detect_task_create must succeed");

  /* Motor Control Task - Priority 8 */
  err = motor_control_task_create();
  RX_ASSERT(err == k_rx_ok, "motor_control_task_create must succeed");

  /* Communication Task - Priority 5 (highest) */
  err = comm_task_create();
  RX_ASSERT(err == k_rx_ok, "comm_task_create must succeed");

  /* Watchdog Monitor Task - Priority 6 */
  err = watchdog_monitor_task_create();
  RX_ASSERT(err == k_rx_ok, "watchdog_monitor_task_create must succeed");

  /* Transition to running state (all tasks created) */
  err = rx_iwdt_set_state(k_system_state_running);
  RX_ASSERT(err == k_rx_ok, "IWDT set running state must succeed");
}

/**
 * @brief Register ThreadX stack overflow detection handler
 *
 * @details
 * Installs the rx_stack_monitor callback that ThreadX invokes when any thread
 * exceeds its allocated stack. Requires TX_ENABLE_STACK_CHECKING to be defined
 * in the ThreadX build configuration.
 *
 * @pre All application tasks created via internal_create_system_tasks()
 * @pre ThreadX TX_ENABLE_STACK_CHECKING enabled at build time
 *
 * @post Stack overflow handler registered with ThreadX kernel
 * @post Any future stack overflow triggers rx_stack_monitor callback
 *
 * @note Executes in single-threaded context (scheduler not started). No synchronization needed.
 *
 * @see rx_stack_monitor_init() Underlying registration function
 *
 * @since Version 1.0.0
 */
static void internal_init_stack_monitor(void)
{
  rx_err_t err = rx_stack_monitor_init();
  RX_ASSERT(err == k_rx_ok, "rx_stack_monitor_init must succeed");
}

/**
 * @brief ThreadX application definition callback - Create application threads and kernel objects
 *
 * @details
 * This function is **called by the ThreadX kernel** immediately after `tx_kernel_enter()`.
 * It provides the application with an entry point to create threads, semaphores, message queues,
 * mutexes, and other RTOS kernel objects.
 *
 * **ThreadX startup sequence:**
 * ```
 * main() -> tx_kernel_enter() -> [ThreadX internal init] -> tx_application_define() -> [scheduler start]
 * ```
 *
 * ## Application Thread Creation
 *
 * This callback delegates to six internal helpers that each handle a single
 * initialization responsibility (NASA Power of 10 Rule 4 compliance):
 *
 * 1. internal_init_bus_manager() - bus manager singleton
 * 2. internal_register_system_buses() - 1-Wire, GPIO, ADC bus configs
 * 3. internal_init_shared_data_and_watchdog() - shared data + IWDT hardware
 * 4. internal_register_iwdt_tasks() - per-task heartbeat registration
 * 5. internal_create_system_tasks() - ThreadX thread creation (7 tasks)
 * 6. internal_init_stack_monitor() - stack overflow detection
 *
 * ## Memory Management
 *
 * **first_unused_memory parameter:**
 * - Points to the first byte of unused SRAM after ThreadX kernel allocation
 * - Used for dynamically creating kernel objects (NOT used in STAR firmware)
 * - STAR uses **static allocation only** (stacks defined at compile-time)
 *
 * **Memory layout after ThreadX init:**
 * | Region | Size | Purpose |
 * |--------|------|---------|
 * | **BSS/Data** | ~10 KB | Global variables, ThreadX kernel data |
 * | **ThreadX heap** | 0 bytes | **Not used** (zero dynamic allocation policy) |
 * | **Task stacks (x7)** | varies | Static arrays in each task module (comm, watchdog, motor, etc.) |
 * | **first_unused_memory** | ~490 KB | Remaining free SRAM (unused) |
 *
 * ## Thread Creation Timing (RX72N @ 240 MHz)
 *
 * | Operation | Duration | Notes |
 * |-----------|----------|-------|
 * | tx_application_define() call | ~5 us | ThreadX callback overhead |
 * | Task creation (7 tasks) | ~140 us | TCB init, stack setup per task |
 * | **Total** | **~145 us** | Fast thread creation |
 *
 * ## Error Handling
 *
 * **Critical assertion:** Thread creation MUST succeed. Failure indicates:
 * - Memory exhaustion (insufficient SRAM for stack)
 * - Invalid thread parameters (priority, stack size)
 * - ThreadX internal error (corruption)
 *
 * **Recovery:** Assert-halt on failure (no recovery possible - critical error)
 *
 * @param[in] first_unused_memory Pointer to first unused SRAM byte after ThreadX kernel allocation
 *                                (Unused in STAR firmware - static allocation only)
 *
 * @return void (No return value - ThreadX callback convention)
 *
 * @pre ThreadX kernel initialized (tx_kernel_enter() called from main())
 * @pre SRAM available for thread stacks
 * @pre first_unused_memory points to valid SRAM address
 *
 * @post All eight application tasks created and ready to run (scheduler starts after return)
 * @post Thread stacks allocated statically and initialized (SP set to stack top for each task)
 * @post Thread priorities configured for eight distinct tasks (comm_task holds priority 5)
 * @post IWDT task monitoring registered for all eight tasks with per-task timeouts
 * @post ThreadX stack overflow handler registered via rx_stack_monitor_init()
 *
 * @note **This function executes BEFORE the ThreadX scheduler starts.** Threads created here
 *       are in READY state but do not execute until this function returns.
 *
 * @note **No blocking calls allowed** in this function (no tx_thread_sleep, tx_semaphore_get, etc.)
 *       as the scheduler is not yet running.
 *
 * @warning **Never return error from this function.** ThreadX callback convention requires void return.
 *          Use RX_ASSERT to halt on critical failures instead.
 *
 * @par Thread Safety:
 * Executes in single-threaded context (scheduler not started yet). No synchronization needed.
 *
 * @par Example Usage (Internal ThreadX Call):
 * @code
 * // ThreadX kernel calls this after tx_kernel_enter():
 * void tx_kernel_enter(void) {
 *   // ... ThreadX internal initialization ...
 *
 *   // Call application-defined callback
 *   tx_application_define(first_unused_memory);
 *
 *   // Start scheduler (threads begin executing)
 *   _tx_thread_schedule();
 * }
 * @endcode
 *
 * @see internal_init_bus_manager() Step 1: Bus manager initialization
 * @see internal_register_system_buses() Step 2: Bus registration
 * @see internal_init_shared_data_and_watchdog() Step 3: Shared data and IWDT
 * @see internal_register_iwdt_tasks() Step 4: Task heartbeat registration
 * @see internal_create_system_tasks() Step 5: ThreadX thread creation
 * @see internal_init_stack_monitor() Step 6: Stack overflow detection
 * @see tx_kernel_enter() Start ThreadX scheduler (calls this callback internally)
 *
 * @since Version 1.0.0
 *
 * @test test_main.c Verify thread creation and scheduler startup
 */
void tx_application_define(void* first_unused_memory)
{
  /* Precondition: first_unused_memory parameter is provided by ThreadX */
  RX_ASSERT(first_unused_memory != nullptr, "Precondition: first_unused_memory must be valid");

  /* =========================================================================
   * Multi-Task Architecture Initialization
   *
   * Task creation order is dependency-aware while the scheduler is not yet
   * running; no task preemption occurs during this phase.
   *
   * Priority Map (lower = higher priority):
   *   5  = Communication (highest - command latency)
   *   6  = Watchdog Monitor (IWDT feeding + task heartbeat checks)
   *   8  = Motor Control (250 Hz control loop)
   *   12 = Obstacle Detection (safety-critical)
   *   13 = IMU (BNO055 + BMP280 at 20 Hz)
   *   15 = Temperature Sensing (1 Hz)
   *   17 = LED Status (20 Hz, visual feedback)
   *   18 = Telemetry Aggregation (20 Hz, lowest)
   * =========================================================================
   */

  /* Step 1: Initialize bus manager (requires ThreadX mutex) */
  internal_init_bus_manager();

  /* Step 2: Register buses with manager (before tasks need them) */
  internal_register_system_buses();

  /* Step 3: Initialize shared data and hardware watchdog */
  internal_init_shared_data_and_watchdog();

  /* Step 4: Register all tasks for IWDT heartbeat monitoring */
  internal_register_iwdt_tasks();

